Repository: ElektroStudios/MTAFRAT-Multi_Tracker_and_Forums_Registration_Availability_Tool
Catalog: Source/MTAFRAT/My Project/Strings.*.resx
Languages: es

source: About...
es: Acerca de...

# AutoPluginRunMsg
source: Run selected plugins every hour:
es: Ejecutar los plugins seleccionados cada hora:

# AutoPluginRunGroupBox
source: Automatic Plugin Execution
es: Ejecución Automática de Plugins

# ComputerGroupBox
source: Computer
es: Equipo

source: Program
es: Programa

source: Settings
es: Opciones

# SingleInstanceMsg
source: Only one instance of the program is allowed.
es: Solo se permite una instancia de la aplicación.

# SystemSleepMsg
source: Prevent the system from entering sleep mode.
es: Impedir que el sistema entre en modo de suspensión.

# StatusMsg_ConnectingFormat
source: 🌐 Connecting to {0} website...
es: 🌐 Conectando con el sitio web de {0}...

# StatusMsg_LoginPageLoaded
source: ✅ Login page loaded.
es: ✅ Página de inicio de sesión cargada.

# StatusMsg_RegisterButtonFound
source: ✅ Register button found.
es: ✅ Botón de registro localizado.

# StatusMsg_RegisterButtonClicked
source: ➡️ Register button clicked.
es: ➡️ Botón de registro presionado.

# StatusMsg_AnalyzingPageContent
source: ⏳ Analyzing page content...
es: ⏳ Analizando el contenido de la página...

# StatusMsg_DetectedRegClosed
source: 🚫 Registration form is closed.
es: 🚫 El formulario de registro está cerrado.

# StatusMsg_DetectedRegOpen
source: 🎉 Registration form is open.
es: 🎉 El formulario de registro está abierto.

# StatusMsg_MsgboxRegOpenFormat
source: 🎉 The registration form is now open on {0}! You can create an account now. 😃
es: 🎉 ¡El formulario de registro está abierto en {0}! Puedes crear una cuenta ahora. 😃

# StatusMsg_ExceptionMessageBoxFormat
source: ❌ There was an error during the last plugin run: {0}
es: ❌ Hubo un error durante la última ejecución del plugin: {0}

# StatusMsg_OperationCompleted
source: 🧹 Closing browser. Operation completed.
es: 🧹 Cerrando el navegador. Operación completada.

# StatusMsg_RegisterPageLoaded
source: ✅ Registration page loaded.
es: ✅ Página de registro cargada.

# RunPluginButton
source: Run plugin
es: Ejecutar plugin

# LastPluginRunMsgFormat
source: Last plugin execution on {0} at {1} hours.
es: Última ejecución el día {0} a las {1} horas.

# LastPluginRunInitialText
source: 💡 Press the main button to run the plugin.
es: 💡 Presione el botón principal para ejecutar el plugin.

# ErrorLoadingPluginFormat
source: ❌ Error loading plugin file '{0}': {1}
es: ❌ Error al cargar el archivo de plugin '{0}': {1}

# NoPluginsAvailable
source: ❌ Error: No plugins are available inside the 'plugins' folder.
es: ❌ Error: No hay ningún plugin disponible en la carpeta 'plugins'.

# DynamicCompilationErrors
source: ❌ Dynamic Code Compilation Errors:
es: ❌ Errores de la compilación de código dinámico:

# RememberSettings
source: Remember current settings
es: Recordar la configuración actual

# MissingDynamicPluginClass
source: ❌ Error: No class of type DynamicPlugin was found in the plugin's source code.
es: ❌ Error: No se encontró ninguna clase del tipo DynamicPlugin en el código fuente del plugin.

# MissingRunAsyncMethod
source: ❌ Error: No method with name RunAsync was found in the plugin's source code.
es: ❌ Error: No se encontró ningún método con el nombre RunAsync en el código fuente del plugin.

# DynamicCodeExecutionErrorFormat
source: ❌ Error executing dynamic code: {0}
es: ❌ Error al ejecutar el código dinámico: {0}

# DuplicatedPluginsDetected
source: Duplicated plugins with the same name have been found. Only the first plugin will be loaded.
es: Se han encontrado varios plugins con el mismo nombre. Solo se cargará el primer plugin.

# GroupBoxApplication
source: Application
es: Aplicación

# LanguageLabel
source: Language
es: Idioma

# OpenWebsiteButton
source: Open Website
es: Abrir sitio web

# ExecutingPlugin
source: ⚙️ Running plugin...
es: ⚙️ Ejecutando plugin...

# AutoPluginRunTimerEnabled
source: ✔️ Automatic plugins execution timer enabled.
es: ✔️ Temporizador de ejecución automática de plugins activado.

# AutoPluginRunTimerDisabled
source: ⛔ Automatic plugins execution timer disabled.
es: ⛔ Temporizador de ejecución automática de plugins desactivado.

# WaitingForTheNextAutomaticExecutionFormat
source: ⌛ Waiting {0} for the next automatic plugins execution...
es: ⌛ Esperando {0} para la siguiente ejecución automática de plugins...

# StatusMsg_CloudflareTrialWait
source: ⌛ Waiting to complete Cloudflare trial...
es: ⌛ Esperando a completar la prueba de Cloudflare...

# StatusMsg_CloudflareTrialCompleted
source: ✅ Cloudflare trial completed.
es: ✅ Prueba de Cloudflare completada.

# CantNavigateToUrlFormat
source: Cannot navigate to the specified URL. Reason: {0}
es: No fue posible navegar a la URL indicada. Motivo: {0}

# CantStablishConnectionFormat
source: Cannot establish a connection to the specified URL. HTTP Status Code: {0}
es: No se puede establecer conexión con la URL especificada. Código de estado HTTP: {0}

# FormCloseWarningPluginWorkInProgress
source: A plugin is currently running. Do you really want to exit now?. Press NO to wait until the plugin execution ends. Press YES to exit, forcefully terminating any Chrome-related child processes.
es: Un plugin se está ejecutando actualmente. ¿Realmente desea salir ahora?. Pulse NO para esperar hasta que finalice la ejecución del plugin. Pulse SÍ para salir, terminando forzosamente cualquier proceso hijo relacionado con Chrome.

source: Clear cache
es: Borrar caché

# ApplicationCacheHasBeenCleaned
source: Application cache has been fully cleaned.
es: La caché de la aplicación se ha borrado completamente.

# ClearingApplicationCacheMsg
source: 🧹 Clearing application cache...
es: 🧹 Borrando caché de la aplicación...

source: Enable paralell execution
es: Habilitar ejecución en paralelo

# ClearSelectedPlugins
source: Clear selection
es: Borrar selección

# SelectAllPlugins
source: Select all
es: Seleccionar todos

source: Show window
es: Mostrar ventana

source: Hide window
es: Ocultar ventana

source: Close application
es: Salir del programa

# ExecutingPluginsTooltip
source: ⚙️ Running plugins...
es: ⚙️ Ejecutando plugins...

# AutoRunPluginCheckedCountFormat
source: 🗹 {0} of {1}
es: 🗹 {0} de {1}

# AutoRunPluginCheckedNoneFormat
source: ☐ 0 of {0}
es: ☐ 0 de {0}

# AutoRunPluginCheckedAllFormat
source: ⬛ {0} of {1}
es: ⬛ {0} de {1}

# ClearingPluginCacheMsg
source: 🧹 Clearing plugin's cache...
es: 🧹 Borrando caché del plugin...

# PluginCacheHasBeenCleaned
source: Plugin's cache has been fully cleaned.
es: La caché del plugin se ha borrado completamente.

# RunAppMinimized
source: Run application minimized to system-tray
es: Iniciar aplicación minimizada en la bandeja del sistema

# RunAllSelectedPluginsNow
source: Run now
es: Ejecutar ahora

# ClearPreviousLogEntries
source: Clear previous log entries on plugin execution
es: Borrar entradas previas del registro al ejecutar un plugin

# StatusMsg_ApplicationPageLoaded
source: ✅ Application page loaded.
es: ✅ Página de solicitud de inscripción cargada.

# StatusMsg_DetectedApplicationClosed
source: 🚫 Application form is closed.
es: 🚫 El formulario de solicitud de inscripción está cerrado.

# StatusMsg_DetectedApplicationOpen
source: 🎉 Application form is open.
es: 🎉 El formulario de solicitud de inscripción está abierto.

# StatusMsg_MsgboxApplicationOpenFormat
source: 🎉 The application form is now open on {0}! You can apply for an account now. 😃
es: 🎉 ¡El formulario de solicitud de inscripción está abierto en {0}! Puedes solicitar una cuenta ahora. 😃

# AboutDescriptionText
source: A multi-tracker and forums registration availability tool through Selenium API.
es: Una herramienta para verificar la disponibilidad de registro en trackers de torrents y foros usando la API de Selenium.

# AllowPluginsToCheckApplicationForms
source: Allow plugins to notify about open application forms
es: Permitir que los plugins notifiquen sobre formularios de solicitud de inscripción (application forms) abiertos

# StatusMsg_TriggerRegEmpty
source: The trigger phrase for the registration form is empty.
es: La frase de activación para el formulario de registro está vacía.

# StatusMsg_TriggerAppEmpty
source: The trigger phrase for the application form is empty.
es: La frase de activación para el formulario de solicitud de inscripción está vacía.

# StatusMsg_PageSourceEmptyFormat
source: The page source code is empty: "{0}"
es: El código fuente de la página está vacío: "{0}"

# LoginPageMenuItem
source: Login Page
es: Página de Inicio de Sesión

# RegistrationPageMenuItem
source: Registration Page
es: Página de Registro

# ApplicationPageMenuItem
source: Application Page
es: Página de Solicitud de Inscripción
